/*
	名字:	飞侠转蛋机
	地圖:	转蛋屋
	描述:	749050400
*/

var itemList = Array(
        Array(1012056, 200, 1, 0), //狗狗鼻子1012056	
        Array(2510177, 450, 1, 1),
        Array(2510182, 450, 1, 1),
        Array(2510187, 450, 1, 1),
        Array(2510192, 450, 1, 1),
        Array(2511106, 100, 1, 1),
        Array(2511040, 250, 1, 1),
        Array(2511079, 250, 1, 1),
        Array(2511097, 250, 1, 1),
        Array(2510175, 150, 1, 1),
        Array(2510176, 150, 1, 1),
        Array(2510239, 150, 1, 1),
        Array(2510171, 150, 1, 1),
        Array(2510172, 150, 1, 1),
        Array(1302002, 500, 1, 0),
        Array(1302008, 500, 1, 0),
        Array(1302009, 500, 1, 0),
        Array(1302010, 500, 1, 0),
        Array(1302011, 500, 1, 0),
        Array(1312005, 500, 1, 0),
        Array(1312007, 500, 1, 0),
        Array(1312008, 500, 1, 0),
        Array(1312009, 500, 1, 0),
        Array(1322014, 500, 1, 0),
        Array(1322016, 500, 1, 0),
        Array(1322017, 500, 1, 0),
        Array(1322018, 500, 1, 0),
        Array(1402000, 500, 1, 0),
        Array(1402002, 500, 1, 0),
        Array(1402003, 500, 1, 0),
        Array(1402007, 500, 1, 0),
        Array(1402011, 500, 1, 0),
        Array(1402053, 500, 1, 0),
        Array(1402062, 500, 1, 0),
        Array(1412002, 500, 1, 0),
        Array(1412003, 500, 1, 0),
        Array(1412005, 500, 1, 0),
        Array(1412006, 500, 1, 0),
        Array(1412007, 500, 1, 0),
        Array(1412035, 500, 1, 0),
        Array(1422001, 500, 1, 0),
        Array(1422003, 500, 1, 0),
        Array(1422005, 500, 1, 0),
        Array(1422007, 500, 1, 0),
        Array(1422009, 500, 1, 0),
        Array(1422039, 500, 1, 0),
        Array(1432002, 500, 1, 0),
        Array(1432004, 500, 1, 0),
        Array(1432005, 500, 1, 0),
        Array(1432006, 500, 1, 0),
        Array(1432022, 500, 1, 0),
        Array(1432050, 500, 1, 0),
        Array(1442001, 500, 1, 0),
        Array(1442003, 500, 1, 0),
        Array(1442007, 500, 1, 0),
        Array(1442009, 500, 1, 0),
        Array(1442010, 500, 1, 0),
        Array(1442071, 500, 1, 0),
        Array(1442078, 500, 1, 0),
        Array(1442080, 500, 1, 0),
        Array(1002002, 400, 1, 0),
        Array(1002003, 400, 1, 0),
        Array(1002004, 400, 1, 0),
        Array(1002005, 400, 1, 0),
        Array(1002006, 400, 1, 0),
        Array(1002007, 400, 1, 0),
        Array(1002009, 400, 1, 0),
        Array(1002011, 400, 1, 0),
        Array(1002021, 400, 1, 0),
        Array(1002022, 400, 1, 0),
        Array(1002023, 400, 1, 0),
        Array(1002024, 400, 1, 0),
        Array(1002025, 400, 1, 0),
        Array(1002027, 400, 1, 0),
        Array(1002028, 400, 1, 0),
        Array(1002029, 400, 1, 0),
        Array(1002039, 400, 1, 0),
        Array(1002040, 400, 1, 0),
        Array(1002041, 400, 1, 0),
        Array(1002042, 400, 1, 0),
        Array(1002043, 400, 1, 0),
        Array(1002044, 400, 1, 0),
        Array(1002045, 400, 1, 0),
        Array(1002046, 400, 1, 0),
        Array(1002047, 400, 1, 0),
        Array(1002048, 400, 1, 0),
        Array(1002049, 400, 1, 0),
        Array(1002050, 400, 1, 0),
        Array(1002051, 400, 1, 0),
        Array(1002052, 400, 1, 0),
        Array(1002055, 400, 1, 0),
        Array(1002056, 400, 1, 0),
        Array(1002058, 400, 1, 0),
        Array(1002059, 400, 1, 0),
        Array(1002084, 400, 1, 0),
        Array(1002085, 400, 1, 0),
        Array(1002086, 400, 1, 0),
        Array(1002087, 400, 1, 0),
        Array(1002088, 400, 1, 0),
        Array(1002091, 400, 1, 0),
        Array(1002092, 400, 1, 0),
        Array(1002093, 400, 1, 0),
        Array(1002098, 400, 1, 0),
        Array(1002099, 400, 1, 0),
        Array(1002100, 400, 1, 0),
        Array(1002101, 400, 1, 0),
        Array(1050000, 400, 1, 0),
        Array(1050005, 400, 1, 0),
        Array(1050006, 400, 1, 0),
        Array(1050007, 400, 1, 0),
        Array(1050011, 400, 1, 0),
        Array(1050021, 400, 1, 0),
        Array(1050022, 400, 1, 0),
        Array(1050163, 400, 1, 0),
        Array(1051010, 400, 1, 0),
        Array(1051011, 400, 1, 0),
        Array(1051012, 400, 1, 0),
        Array(1051013, 400, 1, 0),
        Array(1051014, 400, 1, 0),
        Array(1051015, 400, 1, 0),
        Array(1051016, 400, 1, 0),
        Array(1072000, 400, 1, 0),
        Array(1072002, 400, 1, 0),
        Array(1072003, 400, 1, 0),
        Array(1072007, 400, 1, 0),
        Array(1072009, 400, 1, 0),
        Array(1072011, 400, 1, 0),
        Array(1072039, 400, 1, 0),
        Array(1072040, 400, 1, 0),
        Array(1072041, 400, 1, 0),
        Array(1072046, 400, 1, 0),
        Array(1072047, 400, 1, 0),
        Array(1072051, 400, 1, 0),
        Array(1072052, 400, 1, 0),
        Array(1072053, 400, 1, 0),
        Array(1072112, 400, 1, 0),
        Array(1072113, 400, 1, 0),
        Array(1072126, 400, 1, 0),
        Array(1072127, 400, 1, 0),
        Array(1072132, 400, 1, 0),
        Array(1072133, 400, 1, 0),
        Array(1072134, 400, 1, 0),
        Array(1072135, 400, 1, 0),
        Array(1072147, 400, 1, 0),
        Array(1072148, 400, 1, 0),
        Array(1072149, 400, 1, 0),
        Array(1072168, 400, 1, 0),
        Array(1082000, 400, 1, 0),
        Array(1082001, 400, 1, 0),
        Array(1082003, 400, 1, 0),
        Array(1082004, 400, 1, 0),
        Array(1082005, 400, 1, 0),
        Array(1082006, 400, 1, 0),
        Array(1082007, 400, 1, 0),
        Array(1082008, 400, 1, 0),
        Array(1082009, 400, 1, 0),
        Array(1082010, 400, 1, 0),
        Array(1082011, 400, 1, 0),
        Array(1082023, 400, 1, 0),
        Array(1082024, 400, 1, 0),
        Array(1082025, 400, 1, 0),
        Array(1082035, 400, 1, 0),
        Array(1082036, 400, 1, 0),
        Array(1082059, 400, 1, 0),
        Array(1082060, 400, 1, 0),
        Array(1082061, 400, 1, 0),
        Array(1102000, 400, 1, 0),
        Array(1102001, 400, 1, 0),
        Array(1102002, 400, 1, 0),
        Array(1102003, 400, 1, 0),
        Array(1102004, 400, 1, 0),
        Array(1102011, 400, 1, 0),
        Array(1102012, 400, 1, 0),
        Array(1102013, 400, 1, 0),
        Array(1102014, 400, 1, 0),
        Array(1102015, 400, 1, 0),
        Array(1102016, 400, 1, 0),
        Array(1102017, 400, 1, 0),
        Array(1102018, 400, 1, 0)
        );

function start() {
	var jpzs = "";
	for (var j = 0; j < itemList.length; j++) {
	jpzs += "#v" + itemList[j][0] + ":#";
	}
	if (cm.haveItem(5451001, 1)) {
		cm.sendSimple("冒险岛转蛋机中有各类#b装备、卷轴或稀有新奇的道具#k噢！使用“#b#t5451001##k”就可以抽奖，否则是不可以使用我的。现在要玩转蛋机么? \r\n#b#L2#试试手气吧#l#k\r\n\r\n\r\n下期部分奖励展示:\r\n" + jpzs);
	} else {
		cm.sendSimple("冒险岛转蛋机中有各类#b装备、卷轴或稀有新奇的道具#k噢！使用“#b#t5451001##k”就可以交换。 假如不买转蛋券的话，是不可以使用我的。现在要玩转蛋机么?    \r\n\r\n#r你背包里没#v5451001##z5451001#\r\n\r\n#k部分奖励展示:\r\n" + jpzs + "");
}
}

function action(mode, type, selection) {
	if (mode == 1) {
		var chance = cm.getDoubleFloor(cm.getDoubleRandom() * 500);
		var finalitem = Array();
		for (var i = 0; i < itemList.length; i++) {
		if (itemList[i][1] >= chance) {
			finalitem.push(itemList[i]);
			}
			}
		if (finalitem.length != 0) {
			var item;
			var finalchance = cm.nextInt(finalitem.length);
			var itemId = finalitem[finalchance][0];
			var quantity = finalitem[finalchance][2];
			var notice = finalitem[finalchance][3];
			item = cm.gainGachaponItem(itemId, quantity, "职业转蛋机", notice);
		if (item != -1) {
			cm.gainItem(5451001, -1);
			cm.sendOk("你获得了 #b#t" + item + "##k " + quantity + "个。");
			cm.dispose();
		} else {
			cm.sendOk("你确实有#b#t5451001##k吗？如果是，请你确认在背包的装备，消耗，其它窗口中是否有一格以上的空间。");
			}
			cm.safeDispose();
		} else {
			cm.sendOk("今天的运气可真差，什么都没有拿到。\r\n(获得了安慰奖：#v2000005#。)");
			cm.gainItem(5451001, -1);
			}
			}
		cm.dispose();
}