/*
	名字:	180000003
	地圖:	180000003
	描述:	180000003
*/

function act() {
	rm.doHarvest();
}


//4022000		墨角蘭的種子
//4022001		墨角蘭的花
//4022002		薰衣草的種子
//4022003		薰衣草的花
//4022004		迷迭香的種子
//4022005		迷迭香的花 
//4022006		柑橘的種子
//4022007		柑橘的花
//4022008		香蜂草的種子
//4022009		香蜂草的花
//4022010		稀有薄荷的花
//4022011		茉莉花的種子
//4022012		茉莉花的花
//4022013		茶樹的種子
//4022014		茶樹的花
//4022015		洋甘菊的種子
//4022016		洋甘菊的花
//4022017		廣藿香的種子
//4022018		廣藿香的花
//4022019		杜松的種子
//4022020		杜松的花
//4022021		牛膝草的花
//4022022		鼠尾草
//4022023		藥草的根